////////////////////////////////////////////////////////////////////////////////
// Обновление цен на весь ассортимент товаров из внешней системы:
// - Более миллиона SKU;
// -
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗагрузитьЦеныСCRM(ВидЦены, ВалютаРуб, ИмяСервера, ApiKey) Экспорт
	///======================================================================================================================
	// Внутренний идентификатор товара в CRM, 
	// в конце каждого запроса переназначаем на id последнего полученного элемента
	SinceId = 1;
	ПрекращаемЗагрузкуЦен = Ложь;
	
	///======================================================================================================================
	// Получаем ТЗ для наполнения запросами во внешнюю систему
	Характр = ТЗДляОбработки();

	Пока Не ПрекращаемЗагрузкуЦен Цикл
		///======================================================================================================================
		// Запрос и обработка результата
		АдресСкрипта = "/api/v5/store/products?" + "filter[sinceId]=" + XMLСтрока(SinceId) + "&limit=100" + "&apiKey="
			+ ApiKey;
		Ответ = ЗапросCRM(АдресСкрипта, ИмяСервера);
		
		///======================================================================================================================
		// Если запрос не вернул товаров, то заполняем цены на нашу ТЗ		
		Если Ответ["products"].Количество() = 0 Тогда
			ПрекращаемЗагрузкуЦен = Истина;
			ЗаполнитьЦенамиДокумент(Характр);
			Прервать;
		КонецЕсли;
		
		///======================================================================================================================
		// Обход запроса, получаем цену и заполняем нашу ТЗ
		Для Каждого Товар Из Ответ["products"] Цикл

			Для Каждого Предложение Из Товар["offers"] Цикл

				ЦенаХар =  Предложение.Получить("price");
				Если ЦенаХар = Неопределено Или ЦенаХар = 0 Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрТЗ = Характр.Добавить();
				НоваяСтрТЗ.Цена = ЦенаХар;
				НоваяСтрТЗ.ВнешнийКод = Число(Предложение["externalId"]);

			КонецЦикла;
			
			///======================================================================================================================
			// Если Количество = 90000 идём записывать эти цены в документ установки цен
			// Можно установить значение меньше - разбить на меньшие пакеты
			Если Характр.Количество() = 90000 Тогда
				ЗаполнитьЦенамиДокумент(Характр);
			КонецЕсли;

		КонецЦикла;
		
			///======================================================================================================================
			// Устанавливаем sinceID в значение последнего элемент для получения HTTP запросом следующего пакета товаров

		SinceId =Ответ["products"][Ответ["products"].Вграница()]["id"];

	КонецЦикла;

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьЦенамиДокумент(Характр, ВидЦены, ВалютаРуб)
	///======================================================================================================================
	// Создаётся документ и возвращается объект 
	УстановкаЦены = ПолучитьДокументУстановкиЦены();
	
	///======================================================================================================================
	// Добавляем вид цены, он у нас один
	Если УстановкаЦены.ВидыЦен.Количество() = 0 Тогда
		ВидыЦенДок = УстановкаЦены.ВидыЦен.Добавить();
		ВидыЦенДок.ВидЦены = ВидЦены;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Валюта", ВалютаРуб);
	///======================================================================================================================
	// Засовываем в параметр запроса нашу ТЗ
	Запрос.УстановитьПараметр("ТаблЦРМ", Характр);
	ПоследнийВнешнийКод = 0;
	
	Пока Истина Цикл
		///======================================================================================================================
		// Сам запрос, ТЗ помещаем во временную таблицу, индексируем по ключу
		// Компонуем данные по 1000 штук в последнем запросе
		Запрос.УстановитьПараметр("ПоследнийВнешнийКод", ПоследнийВнешнийКод);
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблЦРМ.ВнешнийКод КАК ВнешнийКод,
		|	ТаблЦРМ.Цена
		|ПОМЕСТИТЬ ТаблЦРМ
		|ИЗ
		|	&ТаблЦРМ КАК ТаблЦРМ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВнешнийКод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
		|	ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаЦО,
		|	ТаблЦРМ.Цена,
		|	&ВидЦены,
		|	&Валюта,
		|	ИСТИНА КАК ЦенаИзмененаВручную,
		|	ХарактеристикиНоменклатуры.API_id КАК ВнешнийКод
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПРАВОЕ СОЕДИНЕНИЕ ТаблЦРМ КАК ТаблЦРМ
		|		ПО ХарактеристикиНоменклатуры.API_id = ТаблЦРМ.ВнешнийКод
		|ГДЕ
		|	ХарактеристикиНоменклатуры.API_id > &ПоследнийВнешнийКод
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВнешнийКод";
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		///======================================================================================================================
		// Добавляем в ТЧ все необходимые даннные, т.к. в запросе мы получили необходимые названия колонок
		// то заполняем новую строку одним методом
		Пока Выборка.Следующий() Цикл
			НоваяЦенаНоменклатуры = УстановкаЦены.Товары2_5.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЦенаНоменклатуры, Выборка);
		КонецЦикла;
		
		ПоследнийВнешнийКод = Выборка.ВнешнийКод;
		
	КонецЦикла;
	
	Попытка
		УстановкаЦены.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		УстановкаЦены.Комментарий = ОписаниеОшибки();
		УстановкаЦены.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	///======================================================================================================================
	// Очищаем нашу ТЗ и идём обратно снова её наполнять
	Характр.Очистить();
	
КонецПроцедуры

Функция ТЗДляОбработки()

	Перем Характр;
	Характр = Новый ТаблицаЗначений;
	Характр.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2,
		ДопустимыйЗнак.Любой)));
	Характр.Колонки.Добавить("ВнешнийКод", Новый ОписаниеТипов("Число"));
	Возврат Характр

КонецФункции

Функция ПолучитьДокументУстановкиЦены()
	
		ДокументУстановкаЦенНоменклатуры = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		ДокументУстановкаЦенНоменклатуры.Дата = ТекущаяДатаСеанса();
		ДокументУстановкаЦенНоменклатуры.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
		ДокументУстановкаЦенНоменклатуры.Согласован = Истина;
		ДокументУстановкаЦенНоменклатуры.Ответственный = Пользователи.ТекущийПользователь();
		Возврат ДокументУстановкаЦенНоменклатуры;
		
КонецФункции

#КонецОбласти